# Project Exercise

In [1]:
import pandas as pd

## Titanic dataset: predict who would survive the Titanic tragedy.

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

---

## Inspect features
Check for missing values. Which features can be dropped?

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

---

## 1.)  Drop the features 'PassengerId', 'Name', 'Ticket', 'Fare', and 'Cabin'.

In [4]:
df = df.drop(["PassengerId", "Name", "Ticket", "Fare", "Cabin"], axis=1)

df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

## 2.) Drop all rows with missing values.

In [5]:
df = df.dropna()

## 3.) Check the size of the dataset after dropping the rows with missing values.

In [7]:
df.shape

(712, 7)

## 4.) Rename the feature "SibSp" to "Sibling/Spouse", and rename "Parch" to "Parent/Child".

In [9]:
df = df.rename(columns = {"SibSp": "Sibling/Spouse", "Parch": "Parent/Child"})

df.head()

   Survived  Pclass     Sex   Age  Sibling/Spouse  Parent/Child Embarked
0         0       3    male  22.0               1             0        S
1         1       1  female  38.0               1             0        C
2         1       3  female  26.0               0             0        S
3         1       1  female  35.0               1             0        S
4         0       3    male  35.0               0             0        S

---

# Feature Transformation

## 5.) Transform the categorical features "Sex" and "Embarked" to numerical values.

In [11]:
df["Sex"] = df["Sex"].replace({'male':0, 'female':1})

In [13]:
df = pd.get_dummies(df, columns=["Embarked"], dtype="int")

df.head()

,Survived,Pclass,Sex,Age,Sibling/Spouse,Parent/Child,Embarked_C,Embarked_Q,Embarked_S
0,0,3,0,22.0,1,0,0,0,1
1,1,1,1,38.0,1,0,1,0,0
2,1,3,1,26.0,0,0,0,0,1
3,1,1,1,35.0,1,0,0,0,1
4,0,3,0,35.0,0,0,0,0,1

---

# Feature Engineering

## 6.) Create a new feature called "Family Size" derived from summing the features "Sibling/Spouse" and "Parent/Child" + 1.
#### Family Size is an individual plus his/her siblings, spouse, parents, children.

In [14]:
df["Family Size"] = df["Sibling/Spouse"]+df["Parent/Child"]+1

df["Family Size"].head(10)

0     2
1     2
2     1
3     2
4     1
6     1
7     5
8     3
9     2
10    3
Name: Family Size, dtype: int64

---

## 7.) The features "Sibling/Spouse" and "Parent/Child" are no longer needed. Drop them.

In [15]:
df = df.drop(["Sibling/Spouse", "Parent/Child"], axis=1)

df.head()

,Survived,Pclass,Sex,Age,Embarked_C,Embarked_Q,Embarked_S,Family Size
0,0,3,0,22.0,0,0,1,2
1,1,1,1,38.0,1,0,0,2
2,1,3,1,26.0,0,0,1,1
3,1,1,1,35.0,0,0,1,2
4,0,3,0,35.0,0,0,1,1

---

## 8.) Move the target "Survived" so that it is the last feature.

In [16]:
df = df.iloc[:, [1,2,3,4,5,6,7,0]]
df.head()

,Pclass,Sex,Age,Embarked_C,Embarked_Q,Embarked_S,Family Size,Survived
0,3,0,22.0,0,0,1,2,0
1,1,1,38.0,1,0,0,2,1
2,3,1,26.0,0,0,1,1,1
3,1,1,35.0,0,0,1,2,1
4,3,0,35.0,0,0,1,1,0

---

## 9.) Separate the data into X (features) and y (target)

In [17]:
# Return only the values, not the DataFrame.
    
X = df.iloc[:,:-1].values

In [18]:
X[:5]

array([[ 3.,  0., 22.,  0.,  0.,  1.,  2.],
       [ 1.,  1., 38.,  1.,  0.,  0.,  2.],
       [ 3.,  1., 26.,  0.,  0.,  1.,  1.],
       [ 1.,  1., 35.,  0.,  0.,  1.,  2.],
       [ 3.,  0., 35.,  0.,  0.,  1.,  1.]])

In [19]:
 # Return only the values.
    
y = df.iloc[:,-1].values

---

In [20]:
y[:10]

array([0, 1, 1, 1, 0, 0, 0, 1, 1, 1])

### Once you believe that your data is appropriately prepared, "Run All Below" (under the Cell menu) to confirm that your data can train a machine learning model.

---

# Machine Learning

## Split the data into train and test sets

In [21]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1, test_size=0.3)

## Standardize the data

In [22]:
# Standardize the features so that they are all on the same scale (between -3 and 3)

from sklearn.preprocessing import StandardScaler
stdsc = StandardScaler()

X_train_std = stdsc.fit_transform(X_train)
X_test_std = stdsc.transform(X_test)

---

# Machine Learning Algorithm

## Logistic Regression

In [23]:
from sklearn.linear_model import LogisticRegression

# Train the model
log_reg = LogisticRegression()
log_reg.fit(X_train_std, y_train);

 ### Evaluate the model's performance on the training set.
  Compares the model's predictions to the y_train answer key and returns the performance

In [24]:
log_reg.score(X_train_std, y_train)

0.8032128514056225

 ### Evaluate the model's performance on the test set.
 Compares the model's predictions to the y_test answer key and returns the performance

In [25]:
log_reg.score(X_test_std, y_test)

0.780373831775701